app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'open'
---
    public function index()
    {
        $userModel = new UserModel();
        $orderModel = new OrderModel();
        $complaintModel = new ComplaintModel();

        $data = [
            'title' => 'Admin Dashboard',
            'total_users' => $userModel->countAll(),
            'total_orders' => $orderModel->countAll(),
            'pending_orders' => $orderModel->where('status', 'pending')->countAllResults(),
            'open_complaints' => $complaintModel->where('status', 'open')->countAllResults()

SELECT `orders`.*, `users`.`username`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC
---
    public function orders()
    {
        $orderModel = new OrderModel();
        $userModel = new UserModel();

        $orders = $orderModel->select('orders.*, users.username')
                            ->join('users', 'users.id = orders.user_id')
                            ->orderBy('orders.created_at', 'DESC')
                            ->findAll();