app/Controllers/Auth.php

                'role' => 'customer', // Default role for registration
            ];

            if ($userModel->insert($data)) {
---
INSERT INTO `users` (`username`, `email`, `password`, `role`) VALUES ('josh', 'joshjulom@gmail.com', '$2y$10$X9EUDBNXO6Xr33eJs8FMRukgtsH0Wft0tDbOOsuYKYUlqp1tVdAiO', 'customer')