app/Controllers/Auth.php

    public function loginPost()
    {
        helper(['form']);
        $session = session();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'staff'
 LIMIT 1

    public function registerPost()
    {
        helper(['form']);
        $session = session();

        $rules = [
            'username' => 'required|min_length[3]|max_length[50]|is_unique[users.username]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]',
        ];

        if (!$this->validate($rules)) {
            $session->setFlashdata('errors', $this->validator->getErrors());
            $session->setFlashdata('old', $this->request->getPost());
            return redirect()->back();
        }

        $userModel = new UserModel();
        $data = [
            'username' => $this->request->getPost('username'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role' => 'customer', // Default role for registration
        ];

        if ($userModel->insert($data)) {
---
INSERT INTO `users` (`username`, `email`, `password`, `role`) VALUES ('josh', 'benzcarllozada123@gmail.com', '$2y$10$rkEw4niefEkX4woC4Wms/.F8tZIz9RYmDVL4YJBH28rjycfkv1Ryy', 'customer')