app/Controllers/Customer.php

    public function orders()
    {
        $userId = session()->get('id');
        $orderModel = new OrderModel();
        $orders = $orderModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = '4'
ORDER BY `created_at` DESC

    public function addOrderPost()
    {
        $userId = session()->get('id');
        $orderModel = new OrderModel();

        $data = [
            'user_id' => $userId,
            'status' => 'pending',
            'total_price' => $this->request->getPost('total_price'),
            'due_date' => $this->request->getPost('due_date'),
            'created_at' => date('Y-m-d H:i:s'),
        ];

        if ($orderModel->insert($data)) {
            // Send order confirmation email
            $emailService = new \App\Libraries\EmailService();
            $orderData = $orderModel->find($orderModel->getInsertID());
            $userModel = new \App\Models\UserModel();
            $userData = $userModel->find($userId);
---
INSERT INTO `orders` (`user_id`, `status`, `total_price`, `due_date`, `created_at`) VALUES ('4', 'pending', '2', '2025-11-14', '2025-11-11 18:15:54')
SELECT *
FROM `orders`
WHERE `orders`.`id` = 2
SELECT *
FROM `users`
WHERE `users`.`id` = '4'