app/Controllers/Staff.php

    public function orders()
    {
        $session = session();
        $staffId = $session->get('id');

        $assignmentModel = new OrderAssignmentModel();
        $orderModel = new OrderModel();

        // First try to get assigned orders
        $assignments = $assignmentModel
            ->where('staff_id', $staffId)
            ->where('active', 1)
            ->findAll();

        $orderIds = array_map(static function ($a) { return $a['order_id']; }, $assignments);
        $orders = [];
        if (!empty($orderIds)) {
            $orders = $orderModel->whereIn('id', $orderIds)->findAll();
        }

        // If no assigned orders, show all orders for staff to assign themselves
        if (empty($orders)) {
            $orders = $orderModel->findAll();
---
SELECT *
FROM `order_assignments`
WHERE `staff_id` = '2'
AND `active` = 1
SELECT *
FROM `orders`

    public function updateStatus($orderId)
    {
        $orderModel = new OrderModel();
        $order = $orderModel->find($orderId);
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '2'

    public function updateStatusPost($orderId)
    {
        $session = session();
        $staffId = $session->get('id');

        $orderModel = new OrderModel();
        $historyModel = new OrderStatusHistoryModel();
        $userModel = new UserModel();

        $order = $orderModel->find($orderId);
        if (!$order) {
            return redirect()->to(site_url('staff/orders'))->with('error', 'Order not found');
        }

        $newStatus = $this->request->getPost('status');
        $note = $this->request->getPost('note');

        if (!in_array($newStatus, ['pending','washing','ready','delivered'], true)) {
            return redirect()->back()->with('error', 'Invalid status');
        }

        $oldStatus = $order['status'];

        $orderModel->update($orderId, ['status' => $newStatus]);
        $historyModel->insert([
            'order_id' => $orderId,
            'changed_by' => $staffId,
            'old_status' => $oldStatus,
            'new_status' => $newStatus,
            'note' => $note,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

        // Send email notification to customer
        $user = $userModel->find($order['user_id']);
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
UPDATE `orders` SET `status` = 'pending'
WHERE `orders`.`id` IN ('1')
INSERT INTO `order_status_history` (`order_id`, `changed_by`, `old_status`, `new_status`, `note`, `created_at`) VALUES ('1', '2', 'pending', 'pending', 'd', '2025-11-11 18:07:12')
SELECT *
FROM `users`
WHERE `users`.`id` = '3'